Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/mailman-tm.tmx
Source language: en
Languages: ca_es

source: Dump the contents of any Mailman `database' file. Usage: %(PROGRAM)s [options] filename Options: --marshal/-m Assume the file contains a Python marshal, overridding any automatic guessing. --pickle/-p Assume the file contains a Python pickle, overridding any automatic guessing. --noprint/-n Don't attempt to pretty print the object. This is useful if there's some problem with the object and you just want to get an unpickled representation. Useful with `python -i bin/dumpdb <file>'. In that case, the root of the tree will be left in a global called "msg". --help/-h Print this help message and exit If the filename ends with `.db', then it is assumed that the file contains a Python marshal. If the file ends with `.pck' then it is assumed to contain a Python pickle. In either case, if you want to override the default assumption -- or if the file ends in neither suffix -- use the -p or -m flags.
ca_es: Bolca els continguts de qualsevol fitxer «database» de Mailman. Forma d'ús: %(PROGRAM)s [opcions] fitxer Opcions: --marshal/-m Assumir que el fitxer conté un fitxer marshal de Python, anul·lant qualsevol esbrinament automàtic. --pickle/-p Assumir que el fitxer conté un fitxer pickle de Python, anul·lant qualsevol esbrinament automàtic. --noprint/-n No tractar d'imprimir amb format l'objecte. Aquesta opció és útil si hi ha algun tipus de problema amb l'objecte i només vol obtenir una representació. Útil amb `python -i bin/dumpdb <file>`. En aquest cas, l'arrel de l'arbre es deixarà en una variable global anomenada "msg". --help/-h Mostra aquest missatge i surt. Si el nom del fitxer acaba amb `.db', aleshores es suposa que el fitxer està en format marshal de Python. Si el nom del fitxer acaba en `.pck' aleshores es suposa que el fitxer està en format pickle de Python. En qualsevol cas, si es vol anul·lar la suposició per defecte -- o si el nom de fitxer no acaba amb cap dels sufixes -- , cal utilitzar l'opció -p o -m.

source: No filename given.
ca_es: No s'ha especificat cap nom de fitxer.

source: Bad arguments: %(pargs)s
ca_es: Els arguments són erronis: %(pargs)s

source: Please specify either -p or -m.
ca_es: Heu d'especifica una de les opcions -p o -m.

source: [----- start %(typename)s file -----]
ca_es: [----- inici del fitxer %(typename)s -----]

source: [----- end %(typename)s file -----]
ca_es: [----- final del fitxer %(typename)s -----]

source: <----- start object %(cnt)s ----->
ca_es: <----- inici de l'objecte %(cnt)s ----->

source: Export an XML representation of a mailing list.
ca_es: Exporta una representació en XML d'una llista de correu.

source: %%prog [options] Export the configuration and members of a mailing list in XML format.
ca_es: %%prog [opcions] Exporta la configuració i els membres d'una llista de correu en format XML.

source: Output XML to FILENAME. If not given, or if FILENAME is '-', standard out is used.
ca_es: Escriu en XML al NOMDELFITXER. Si no s'especifica el NOMDELFITXER, o bé és «-», s'utilitza la sortida estàndard.

source: Specify the RFC 2307 style hashing scheme for passwords included in the output. Use -P to get a list of supported schemes, which are case-insensitive.
ca_es: Especifica l'esquema de resum a l'estil de la RFC 2307 per a les contrasenyes incloses a la sortida. Utilitzeu -P per a obtenir una llista dels esquemes compatibles, els quals no distingeixen entre majúscules i minúscules.

source: List the supported password hashing schemes and exit. The scheme labels are case-insensitive.
ca_es: Mostra una llista dels esquemes de resum de contrasenyes compatibles i surt Les etiquetes dels esquemes no distingeixen entre majúscules i minúscules.

source: The list to include in the output. If not given, then all mailing lists are included in the XML output. Multiple -l flags may be given.
ca_es: La llista a incloure a la sortida. Si no s'especifica, s'inclouran totes les llistes a la sortida en XML. També es pot especificar més d'un senyalador -l.

source: Unexpected arguments
ca_es: No s'esperaven aquests arguments

source: Invalid password scheme
ca_es: L'esquema de contrasenya no és vàlid

source: Search regular expression required
ca_es: La expressió regular per buscar és requerida

source: No lists to search
ca_es: No hi ha llistes per buscar

source: found in:
ca_es: trobat a:

source: (as owner)
ca_es: (com amo)

source: Reset a list's web_page_url attribute to the default setting. This script is intended to be run as a bin/withlist script, i.e. % bin/withlist -l -r fix_url listname [options] Options: -u urlhost --urlhost=urlhost Look up urlhost in the virtual host table and set the web_page_url and host_name attributes of the list to the values found. This essentially moves the list from one virtual domain to another. Without this option, the default web_page_url and host_name values are used. -v / --verbose Print what the script is doing. If run standalone, it prints this help text and exits.
ca_es: Re-establir l'atribut web_page_url d'una llista al seu valor per defecte. Aquest script s'ha d'executar com un script bin/withlist, ex. % bin/withlist -l -r fix_url listname [opcions] Opcions: -u urlhost --urlhost=urlhost Cercar el a la taula de virtual host i establir els atributs web_page_url i host_name dels valors trobats. Això és essencial per moure llistes d'un domini virtual a un altre. Amb aquesta opció es fan servir els valors per defecte de web_page_url i host_name -v / --verbose Mostra el qeu està fent l'script. Si s'executa sol, mostra aquesta ajuda i surt.

source: Setting web_page_url to: %(web_page_url)s
ca_es: Establint web_page_url a: %(web_page_url)s

source: Setting host_name to: %(mailhost)s
ca_es: Establint host_name a: %(mailhost)s

source: Inject a message from a file into Mailman's incoming queue. Usage: inject [options] [filename] Options: -h / --help Print this text and exit. -l listname --listname=listname The name of the list to inject this message to. Required. -q queuename --queue=queuename The name of the queue to inject the message to. The queuename must be one of the directories inside the qfiles directory. If omitted, the incoming queue is used. filename is the name of the plaintext message file to inject. If omitted, standard input is used.
ca_es: Injectar un missatge d'un fitxer a la cua d'entrada de Mailman. Forma d'ús: inject [opcions] [filename] Opcions: -h / --help Mostra aquest missatge i surt. -l listname --listname=listname El nom de la llista a la que s'injectarà el missatge. Aquesta opció es requereix. -q queuename --queue=queuename El nom de la cua a la que s'injectara el missatge. El nom de la cua ha de ser un dels directoris de qfiles. So s'omet, es fa servir la cua d'entrada (incoming) filename és el nom del fitxer en text pla del missatge que es vol injectar. Si s'omet, es fa servir el standard input.

source: Bad queue directory: %(qdir)s
ca_es: Directori de cua erroni: %(qdir)s

source: A list name is required
ca_es: Un nom per a la llista és requerit

source: List all the owners of a mailing list. Usage: %(program)s [options] listname ... Where: --all-vhost=vhost -v=vhost List the owners of all the mailing lists for the given virtual host. --all -a List the owners of all the mailing lists on this system. --help -h Print this help message and exit. `listname' is the name of the mailing list to print the owners of. You can have more than one named list on the command line.
ca_es: Llista tots els amos d'una llista de correu. Forma d'ús: %(program)s [opcions] listname ... On: --all-vhost=vhost -v=vhost Llista els amos de totes les llistes de correu per el host virtual donat. --all -a Llista els amos de totes les llistes de correu del sistema. --help -h Mostra aquest missatge i surt. `listname' és el nom de la llista de correu de la que es vol obtenir el llistat dels amos. Pots posar més d'un nom a la línia d'ordres.

source: List: %(listname)s, Owners: %(owners)s
ca_es: Llista: %(listname)s, Amos: %(owners)s

source: List all mailing lists. Usage: %(program)s [options] Where: -a / --advertised List only those mailing lists that are publically advertised --virtual-host-overview=domain -V domain List only those mailing lists that are homed to the given virtual domain. This only works if the VIRTUAL_HOST_OVERVIEW variable is set. -b / --bare Displays only the list name, with no description. -h / --help Print this text and exit.
ca_es: Llistar totes les llistes de correu electrònic. Forma d'ús: %(program)s [opcions] on: -a / --advertised llistar només les llistes de correu electrònic que són anunciades públicament --virtual-host-overview=domini -V domini llistar només les llistes de correu electrònic del domini virtual donat. això només funciona si la variable VIRTUAL_HOST_OVERVIEW està establerta. -b / --bare Mostrar només el nom de llista, sense descripció. -h / --help Mostra aquest missatge i surt.

source: No matching mailing lists found
ca_es: No s'han trobat llistes de correu que coincideixin

source: matching mailing lists found:
ca_es: llistes de correu coincidents:

source: List all the members of a mailing list. Usage: %(PROGRAM)s [options] listname Where: --output file -o file Write output to specified file instead of standard out. --regular / -r Print just the regular (non-digest) members. --digest[=kind] / -d [kind] Print just the digest members. Optional argument can be "mime" or "plain" which prints just the digest members receiving that kind of digest. --nomail[=why] / -n [why] Print the members that have delivery disabled. Optional argument can be "byadmin", "byuser", "bybounce", or "unknown" which prints just the users who have delivery disabled for that reason. It can also be "enabled" which prints just those member for whom delivery is enabled. --fullnames / -f Include the full names in the output. --preserve / -p Output member addresses case preserved the way they were added to the list. Otherwise, addresses are printed in all lowercase. --invalid / -i Print only the addresses in the membership list that are invalid. Ignores -r, -d, -n. --unicode / -u Print addresses which are stored as Unicode objects instead of normal string objects. Ignores -r, -d, -n. --help -h Print this help message and exit. listname is the name of the mailing list to use. Note that if neither -r or -d is supplied, both regular members are printed first, followed by digest members, but no indication is given as to address status.
ca_es: Llista tots els subscriptors d'una llista de correu. Forma d'ús: %(PROGRAM)s [opcions] listname On: --output file -o file Escriu la sortida al fitxer especificat en lloc de la sortida estàndard. --regular / -r Mostra només els subscriptors normals (sense lliurament per resum). --digest[=tipus] / -d [tipus] Mostra només els membres amb lliurament per resum. L'argument opcional pot tenir el valor «mime» o «plain», el qual farà que només es mostrin els subscriptors amb el tipus de resum especificat. --nomail[=motiu] / -n [motiu] Mostra els subscriptors que tenen el lliurament desactivat. L'argument opcional pot tenir el valor «byadmin», «byuser», «bybounce», o bé «unknown», amb la qual cosa només es mostraran els subscriptors amb el lliurament desactivat pel motiu especificat. També pot ser «enabled», cosa que farà que només es mostrin els subscriptors amb el lliurament activat. --fullnames / -f Mostra els noms complets a la sortida. --preserve -p Mostra les adreces dels subscriptors respectant les majúscules i minúscules que s'utilitzaren en afegir-los a la llista. En cas contrari, totes les adreces es mostraran en minúscules. --invalid / -i Mostra només les adreces de la llista de subscriptors que no són vàlides. Aquesta opció ignorarà les altres opcions -r, -d, -n --unicode / -u Mostra les adreces que estan emmagatzemades com a objectes Unicode en lloc d'estar-ho com a objectes de cadena normals. Aquesta opció ignorarà les altres opcions -r, -d, -n --help -h Mostra aquest missatge i surt. listname és el nom de la llista a utilitzar. Tingueu en compte que si no s'especifica cap dels arguments -r o -d, es mostraran primer ambdós subscriptors normals, seguits dels subscriptors amb resum, però no s'indicarà l'estat de l'adreça.

source: Bad --nomail option: %(why)s
ca_es: Opció --normal errònia: %(why)s

source: Bad --digest option: %(kind)s
ca_es: Opció --digest errònia: %(kind)s

source: Could not open file for writing:
ca_es: No es pot obrir el fitxer per a escriptura:

source: List the owners of a mailing list, or all mailing lists. Usage: %(PROGRAM)s [options] [listname ...] Options: -w / --with-listnames Group the owners by list names and include the list names in the output. Otherwise, the owners will be sorted and uniquified based on the email address. -m / --moderators Include the list moderators in the output. -h / --help Print this help message and exit. listname Print the owners of the specified lists. More than one can appear after the options. If there are no listnames provided, the owners of all the lists will be displayed.
ca_es: Llista els amos d'una llista de correu, o de totes les llistes de correu. Forma d'ús: %(PROGRAM)s [opcions] [listname ...] Options: -w / --with-listnames agrupar els amos per noms de llista i incloure els noms de les llistes D'altra forma, els amos s'ordenaran per l'adreça de correu electrònic. -m / --moderators Inclou la llista dels moderadors. -h / --help Mostra aquest missatge d'ajuda i surt. listname Mostra els amos d'una llista específica. En pots escriure més d'una després de les opcions. Si no especifiques cap llista, es mostraran els amos de totes les llistes.

source: Primary start-up and shutdown script for Mailman's qrunner daemon. This script starts, stops, and restarts the main Mailman queue runners, making sure that the various long-running qrunners are still alive and kicking. It does this by forking and exec'ing the qrunners and waiting on their pids. When it detects a subprocess has exited, it may restart it. The qrunners respond to SIGINT, SIGTERM, and SIGHUP. SIGINT and SIGTERM both cause the qrunners to exit cleanly, but the master will only restart qrunners that have exited due to a SIGINT. SIGHUP causes the master and the qrunners to close their log files, and reopen then upon the next printed message. The master also responds to SIGINT, SIGTERM, and SIGHUP, which it simply passes on to the qrunners (note that the master will close and reopen its own log files on receipt of a SIGHUP). The master also leaves its own process id in the file data/master-qrunner.pid but you normally don't need to use this pid directly. The `start', `stop', `restart', and `reopen' commands handle everything for you. Usage: %(PROGRAM)s [options] [ start | stop | restart | reopen ] Options: -n/--no-restart Don't restart the qrunners when they exit because of an error or a SIGINT. They are never restarted if they exit in response to a SIGTERM. Use this only for debugging. Only useful if the `start' command is given. -u/--run-as-user Normally, this script will refuse to run if the user id and group id are not set to the `mailman' user and group (as defined when you configured Mailman). If run as root, this script will change to this user and group before the check is made. This can be inconvenient for testing and debugging purposes, so the -u flag means that the step that sets and checks the uid/gid is skipped, and the program is run as the current user and group. This flag is not recommended for normal production environments. Note though, that if you run with -u and are not in the mailman group, you may have permission problems, such as begin unable to delete a list's archives through the web. Tough luck! -s/--stale-lock-cleanup If mailmanctl finds an existing master lock, it will normally exit with an error message. With this option, mailmanctl will perform an extra level of checking. If a process matching the host/pid described in the lock file is running, mailmanctl will still exit, but if no matching process is found, mailmanctl will remove the apparently stale lock and make another attempt to claim the master lock. -q/--quiet Don't print status messages. Error messages are still printed to standard error. -h/--help Print this message and exit. Commands: start - Start the master daemon and all qrunners. Prints a message and exits if the master daemon is already running. stop - Stops the master daemon and all qrunners. After stopping, no more messages will be processed. restart - Restarts the qrunners, but not the master process. Use this whenever you upgrade or update Mailman so that the qrunners will use the newly installed code. reopen - This will close all log files, causing them to be re-opened the next time a message is written to them
ca_es: Script principal d'inici i parada del dimoni qrunner de Mailman. Aquest script arrenca, para i reinicia l'encarregat de processar la cua, assegurat que els distints processos de llarga durada segueixin vius. Això es fa mitjançant un fork i executant el subprocés qrunner i esperant segons el seu pid. Quan detecti que un subprocés ha acabat, podria reiniciar-lo. Els qrunners responen a SIGINT, SIGTERM, i SIGHUP. SIGINT i SIGTERM fan que els qrunners acabin de forma correcta, però el mestre només reiniciarà els qrunners que hagin acabat amb SIGINT. SIGHUP fa que el mestre i els qrunners es tanquin de forma adequada els seus fitxers log. El mestre també respon a SIGINT, SIGTERM, i SIGHUP. El mestre també deixa el seu propi id de procés al fitxer data/master-qrunner.pid però normalment no e´s necessari fer servir directament aquets pid. Les ordres `start', `stop', `restart', i `reopen' ho fan tot per tu. Forma d'ús: %(PROGRAM)s [opcions] [ start | stop | restart | reopen ] Opcions: -n/--no-restart No començar els qrunners si han sortit a causa d'un error o un SIGINT. No són mai reiniciats si surten com a resposta a SIGTERM. Fes servir això només per debugging. Només és útil si és dona l'rdre `start' -u/--run-as-user Normalment aquest script no es voldrà executar si el id de l'usuari i el del grup no estan establerts al usuari i grup `mailman' (com es va definir quan vas configurar Mailman). Si s'executa com a root, aques script canviara a aquest usuari i grup. Això pot ser inconvenient per fer proves i debugging, per això la senyal -u que el pas que estableix el uid/gid es salta, i el programa s'executa amb l'usuari i grup actual. Aquesta senyal no es recomana per a entorns de productivitat. Nota que si fas servir la senyal -u i no ets al grup de mailman, pots tenir problemes de permisos i no poder borrar un arxiu de llista desde la web. -s/--stale-lock-cleanup Si mailman troba el bloqueig mestre, normalment sorktirà amb un missatge d'error. Amb aquesta opció, mailmanctl realitzarà un nivell extra de comprovació. Si un porcés coincideix amb el host/pid del fitxer de bloqueig que s'està executant, mailmanctl sortira, però no sortirà si no es troben processos coincidents, mailmanctl eliminarà els bloquejos caducats. -q/--quiet No mostrar el missatge d'estat. Els missatges d'error si que es mostren. -h/--help Mostra el missatge i surt. Ordres: start - Començar el dimoni mestre i tots els qrunners. Mostra un missatge isurt si ja s'està executant el dimoni. stop - para el dimoni mestre i tots els qrunners. Després de parar, no es processaran mes missatges. restart - Reinicia els qrunners, però no el procés mestre. Fes servir això quan actualitzis el Mailman aixi els qrunners faran servir el nou codi instal·lat. reopen - Això tanca tots els fitxers log, causant la seva reobertura la próxima vegada se hi next.

source: PID unreadable in: %(pidfile)s
ca_es: el PID no es pot llegir a: %(pidfile)s

source: Is qrunner even running?
ca_es: encara s'està executant el qrunner?

source: No child with pid: %(pid)s
ca_es: No hi ha cap fill amb el pid: %(pid)s

source: Stale pid file removed.
ca_es: Fitxer pid vell eliminat.

source: The master qrunner lock could not be acquired because it appears as if another master qrunner is already running.
ca_es: No s'ha pogut adquirir el bloqueig del qrunner principal. Sembla que hi ha un altre qrunner executant-se.

source: The master qrunner lock could not be acquired. It appears as though there is a stale master qrunner lock. Try re-running mailmanctl with the -s flag.
ca_es: El bloqueig mestre de qrunner no s'ha pogut adquirir perquè sembla ser que hi ha un altre qrunner mestre executant-se. Prova a executar el mailmanctl amb la senyal -s.

source: The master qrunner lock could not be acquired, because it appears as if some process on some other host may have acquired it. We can't test for stale locks across host boundaries, so you'll have to do this manually. Or, if you know the lock is stale, re-run mailmanctl with the -s flag. Lock file: %(LOCKFILE)s Lock host: %(status)s Exiting.
ca_es: No s'ha pogut aconseguir el bloqueig del qrunner mestre, perquè sembla com si l'hagués obtingut algun procés en un altre servidor. No podem comprovar si hi ha bloquejos oblidats en altres servidors, així que haurà de fer-lo vostè manualment. O, si sap que el bloqueig està oblidat, pot tornar a executar mailmanctl amb l'opció -s. Fitxer bloquejat: %(LOCKFILE)s Host bloquejat: %(status)s Sortint.

source: Site list is missing: %(sitelistname)s
ca_es: La llista del Site no hi és: %(sitelistname)s

source: Run this program as root or as the %(name)s user, or use -u.
ca_es: Executar aquest programa com root o amb el usuari %(name)s, o utilitza l'opció -u.

source: No command given.
ca_es: No has donat cap ordre.

source: Bad command: %(command)s
ca_es: Ordre errònia: %(command)s

source: Warning! You may encounter permission problems.
ca_es: Atenció! pots trobar-te amb problemes de permisos.

source: Shutting down Mailman's master qrunner
ca_es: Parant el qrunner principal de Mailman

source: Restarting Mailman's master qrunner
ca_es: Re-iniciant el qrunner principal de Mailman

source: Re-opening all log files
ca_es: Re-obrint tots els fitxers log

source: Starting Mailman's master qrunner.
ca_es: Iniciant el qrunner principal de Mailman

source: Set the site password, prompting from the terminal. The site password can be used in most if not all places that the list administrator's password can be used, which in turn can be used in most places that a list users password can be used. Usage: %(PROGRAM)s [options] [password] Options: -c/--listcreator Set the list creator password instead of the site password. The list creator is authorized to create and remove lists, but does not have the total power of the site administrator. -h/--help Print this help message and exit. If password is not given on the command line, it will be prompted for.
ca_es: Estableix la contrasenya del lloc web, demanant-la des del terminal. La contrasenya del site es pot fer servir gairebé als mateixos llocs que la contrasenya de l'administrador, que també es pot fer servir a gairebé tots els llocs que la contrasenya d'usuari d'una llista. Forma d'ús: %(PROGRAM)s [opcions] [contrasenya] Opcions: -c/--listcreator Establir la contrasenya del creador de la llista en lloc de la contrasenya del site. El creador de la llista està autoritzat a crear i eliminar llistes, però no té control total sobre l'administrador del site. -h/--help Mostra aquest missatge i surt. Si no s'especifica la contrasenya, es demanarà.

source: site
ca_es: lloc

source: list creator
ca_es: creador de la llista

source: New %(pwdesc)s password:
ca_es: Nova contrasenya %(pwdesc)s:

source: Again to confirm password:
ca_es: Una altra vegada per confirmar la contrasenya:

source: Passwords do not match; no changes made.
ca_es: Les contrasenyes no coincideixen; no s'ha fet cap canvi.

source: Interrupted...
ca_es: Interromput...

source: Password changed.
ca_es: S'ha canviat la contrasenya.

source: Password change failed.
ca_es: Ha fallat el canvi de contrasenya.
